app/views/debts/_creditor.html.erb

        <td><%= debt.date %></td>
        <td><%= debt.debtor.first_name %> <%= debt.debtor.last_name %></td>
---
SELECT "debts".* FROM "debts"