app/views/debts/_debtor.html.erb

        <td><%= debt.date %></td>
        <td><%= debt.creditor.first_name %> <%= debt.debtor.last_name %></td>
---
SELECT "debts".* FROM "debts" WHERE "debts"."debtor_id" = 2