app/views/debts/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
    <div class="controls">
        <%= f.select :creditor_id, User.where("id != #{current_user.id}").collect {|p| [ p.first_name, p.id ] } %>