app/controllers/debts_controller.rb

SELECT "debts".* FROM "debts" WHERE "debts"."debtor_id" = 2
---
  def index
    @debts = Debt.where("debtor_id = ?", current_user.id)

SELECT "debts".* FROM "debts" WHERE "debts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @debt = Debt.find(params[:id])

INSERT INTO "debts" ("body", "created_at", "creditor_id", "date", "debtor_id", "is_paid", "title", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @debt = Debt.new(params[:debt])
    respond_to do |format|
      if @debt.save